#!/usr/bin/env python
# -*- coding: utf-8 -*-
'''
@Author: Ulysses
@Date: 2019-10-29 14:45:49
@Description: DataFrame 数据的选择
@LastEditTime: 2019-11-05 19:31:12
'''
import numpy as np
import pandas as pd

dates = pd.date_range('20190101', periods=6)
df = pd.DataFrame(
    np.arange(24).reshape(6, 4),
    index=dates,
    columns=['A', 'B', 'C', 'D'])
print(df)
"""
             A   B   C   D
2019-01-01   0   1   2   3
2019-01-02   4   5   6   7
2019-01-03   8   9  10  11
2019-01-04  12  13  14  15
2019-01-05  16  17  18  19
2019-01-06  20  21  22  23
"""

print("选取数据列\n", df.A, df['A'], sep='\n')
"""
2019-01-01     0
2019-01-02     4
2019-01-03     8
2019-01-04    12
2019-01-05    16
2019-01-06    20
Freq: D, Name: A, dtype: int32
"""

print("跨越多行\n", df[:3], df['2019-01-03':'2019-01-05'], sep='\n')
"""
            A  B   C   D
2019-01-01  0  1   2   3
2019-01-02  4  5   6   7
2019-01-03  8  9  10  11
             A   B   C   D
2019-01-03   8   9  10  11
2019-01-04  12  13  14  15
2019-01-05  16  17  18  19
"""

print('使用标签loc选择数据\n', df.loc['2019-01-01'])
"""
使用loc选择数据
A    0
B    1
C    2
D    3
Name: 2019-01-01 00:00:00, dtype: int32
"""

print("选择一行的多列数据\n", df.loc["2019-01-05",['A', "D"]])
"""
选择一行的多列数据
 A    16
D    19
Name: 2019-01-05 00:00:00, dtype: int32
"""

print("选择所有行\n", df.loc[:, ['B']])
"""
选择所有行
              B
2019-01-01   1
2019-01-02   5
2019-01-03   9
2019-01-04  13
2019-01-05  17
2019-01-06  21
"""

# 根据序列iloc
print('根据位置选择\n', df.iloc[3, 1], df.iloc[3:5, 1:3],
     df.iloc[[1, 3, 5], [1, 3]], sep='\n')
"""
根据位置选择

13

             B   C
2019-01-04  13  14
2019-01-05  17  18

             B   D
2019-01-02   5   7
2019-01-04  13  15
"""

print("混合选择ix\n", df.ix[:3, ['A', 'B']])
"""deprecated!
混合选择ix
             A  B
2019-01-01  0  1
2019-01-02  4  5
2019-01-03  8  9
"""

print("根据判断筛选数据\n", df[df.A>8])
"""
根据判断筛选数据
              A   B   C   D
2019-01-04  12  13  14  15
2019-01-05  16  17  18  19
2019-01-06  20  21  22  23
"""
